# Taps - Tap a formula repository.
# https://docs.brew.sh/Manpage#tap-options-userrepo-url
tap 'homebrew/cask'                 # https://github.com/Homebrew/homebrew-cask
tap 'homebrew/cask-versions'        # https://github.com/Homebrew/homebrew-cask-versions
tap 'homebrew/bundle'               # https://github.com/Homebrew/homebrew-bundle
tap 'stripe/stripe-cli'             # https://github.com/stripe/stripe-cli

# Binaries
brew 'ack'                              # https://formulae.brew.sh/formula/ack - Search tool like grep, but optimized for programmers
brew 'bash'                             # https://formulae.brew.sh/formula/bash - Latest Bash version
brew 'bat'                              # https://formulae.brew.sh/formula/bat - Clone of cat(1) with syntax highlighting and Git integration
brew 'coreutils'                        # https://formulae.brew.sh/formula/coreutils - Those that come with macOS are outdated
brew 'ffmpeg'                           # https://formulae.brew.sh/formula/ffmpeg - Play, record, convert, and stream audio and video
brew 'gh'                               # https://formulae.brew.sh/formula/gh - GitHub command-line tool
brew 'git'                              # https://formulae.brew.sh/formula/git - Distributed revision control system
brew 'git-delta'                        # https://formulae.brew.sh/formula/git-delta - A syntax-highlighting pager for git and diff
brew 'grep'                             # https://formulae.brew.sh/formula/grep - GNU grep, egrep and fgrep
brew 'httpie'                           # https://formulae.brew.sh/formula/httpie - User-friendly cURL replacement (command-line HTTP client)
brew 'hub'                              # https://formulae.brew.sh/formula/hub - Add GitHub support to git on the command-line
brew 'jq'                               # https://formulae.brew.sh/formula/jq - Lightweight and flexible command-line JSON processor
brew 'neovim'                           # https://formulae.brew.sh/formula/neovim - Vim-fork focused on extensibility and agility
brew 'mackup'                           # https://formulae.brew.sh/formula/mackup - Backup and restore macOS applications and settings
brew 'mas'                              # https://formulae.brew.sh/formula/mas - Mac App Store manager
brew 'pkg-config'                       # https://formulae.brew.sh/formula/pkg-config - Manage compile and link flags for libraries https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'         # https://github.com/stripe/stripe-cli - Stripe command-line interface
brew 'stripe/stripe-mock/stripe-mock'   # https://github.com/stripe/stripe-mock - Stripe mock server
brew 'trash'                            # https://formulae.brew.sh/formula/trash - Manage the Trash bin
brew 'tree'                             # https://formulae.brew.sh/formula/tree - List directories in a tree structure

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'node'
brew 'yarn'
brew 'yqrashawn/goku/goku'

# Apps
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'brave-browser'
cask 'cron'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'fig'
cask 'figma'
cask 'firefox'
cask 'flux'
cask 'github'
cask 'google-chrome'
cask 'grammarly'
cask 'hammerspoon'
cask 'herd'
cask 'iterm2'
cask 'karabiner-elements'
cask 'notion'
cask 'obsidian'
cask 'screenflow'
cask 'ray'
cask 'sizzy'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'telegram'
cask 'tinkerwell'
cask 'todoist'
cask 'visual-studio-code'
cask 'warp'
cask 'whatsapp'
cask 'zoom'

# Mac App Store
mas 'Gifox', id: 1461845568
mas 'Pixelmator Pro', id: 1289583905
mas 'Twitter', id: 1482454543
mas 'Time Sink', id: 1494023538
