# Taps - Tap a formula repository.
# https://docs.brew.sh/Manpage#tap-options-userrepo-url
tap 'homebrew/cask'                 # https://github.com/Homebrew/homebrew-cask
tap 'homebrew/cask-versions'        # https://github.com/Homebrew/homebrew-cask-versions
tap 'homebrew/bundle'               # https://github.com/Homebrew/homebrew-bundle
tap 'nicoverbruggen/homebrew-cask'  # https://github.com/nicoverbruggen/phpmon

# Binaries
brew 'ack'                      # https://formulae.brew.sh/formula/ack - Search tool like grep, but optimized for programmers
brew 'bash'                     # https://formulae.brew.sh/formula/bash - Latest Bash version
brew 'coreutils'                # https://formulae.brew.sh/formula/coreutils - Those that come with macOS are outdated
brew 'gh'                       # https://formulae.brew.sh/formula/gh - GitHub command-line tool
brew 'git'                      # https://formulae.brew.sh/formula/git - Distributed revision control system
brew 'grep'                     # https://formulae.brew.sh/formula/grep - GNU grep, egrep and fgrep
brew 'httpie'                   # https://formulae.brew.sh/formula/httpie - User-friendly cURL replacement (command-line HTTP client)
brew 'hub'                      # https://formulae.brew.sh/formula/hub - Add GitHub support to git on the command-line
brew 'jq'                       # https://formulae.brew.sh/formula/jq - Lightweight and flexible command-line JSON processor
brew 'mas'                      # https://formulae.brew.sh/formula/mas - Mac App Store manager
brew 'pkg-config'               # https://formulae.brew.sh/formula/pkg-config - Manage compile and link flags for libraries https://github.com/driesvints/dotfiles/issues/20
brew 'trash'                    # https://formulae.brew.sh/formula/trash - Manage the Trash bin
brew 'tree'                     # https://formulae.brew.sh/formula/tree - List directories in a tree structure

# Development
brew 'php'
brew 'php@7.4'
brew 'php@7.3'
brew 'composer'
brew 'nginx'
brew 'node'
brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'brave-browser'
cask 'dbngin'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'flux'
cask 'github'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'grammarly'
cask 'iterm2'
cask 'lastpass'
cask 'phpmon'
cask 'ray'
cask 'sequel-ace'
cask 'sizzy'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'zoom'

# Mac App Store
mas 'Twitter', id: 1482454543
mas 'Pixelmator Pro', id: 1289583905
